chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/osc/processor/osc_p32mz1024efk144.h
PLIB_INLINE SFR_DATA _OSC_PRIMARY_READY_MASK(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _CLKSTAT_POSCRDY_MASK;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_SECONDARY_READY_MASK(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _CLKSTAT_SOSCRDY_MASK;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_LPRC_READY_MASK(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _CLKSTAT_LPRCRDY_MASK;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_SYSTEM_PLL_READY_MASK(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _CLKSTAT_DIVSPLLRDY_MASK;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_OSC_SWITCH_INIT_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_OSWEN_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_SECONDARY_ENABLE_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_SOSCEN_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_OSC_CLOCK_FAIL_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_CF_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_ON_WAIT_ACTION_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_SLPEN_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_OSC_CLOCK_LOCK_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_CLKLOCK_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_OSC_SELECTMZ_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_NOSC_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_OSC_CURRENT_GET_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_COSC_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_SLEEP_TO_SPEED_STARTUP_CONTROL_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_SLP2SPD_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_DREAM_MODE_ENABLE_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_DRMEN_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_OSC_FRC_DIVISOR_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCCON_FRCDIV_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_OSC_FRC_TUNING_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _OSCTUN_TUN_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_OSC_REGISTER_LOCK_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return (SFR_DATA)0;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_REF_BASECLK_SELECT_1_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _REFO1CON_ROSEL_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_REF_CHANGE_ACTIVE_1_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _REFO1CON_ACTIVE_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_REF_BASECLK_CHANGE_1_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _REFO1CON_DIVSWEN_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_REF_STOPINSLEEP_1_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _REFO1CON_RSLP_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_REF_OUTPUT_ENABLE_1_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _REFO1CON_OE_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_REF_STOPINIDLE_1_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _REFO1CON_SIDL_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_REF_CLK_ENABLE_1_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _REFO1CON_ON_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _OSC_REF_CLK_OUTPUT_DIV_1_POS(OSC_MODULE_ID i)
{
    switch (i) {
        case OSC_ID_0 :
            return _REFO1CON_RODIV_POSITION;
        case OSC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

